#+TITLE: Accessing DPS5020 Digital Power Supply using sigrok
#+DATE: 2023-02-21
#+author: jj
#+LATEX: \setlength{\parindent}{0pt}
#+latex_compiler: pdflatex
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+creator: Emacs 27.1 (Org mode 9.3)


*** ~sigrok-cli~ -version used
This document uses sigrok version 
#+BEGIN_SRC bash :eval no-export :results output :exports results
sigrok-cli --version
#+END_SRC

#+RESULTS:
#+begin_example
sigrok-cli 0.7.2

Libraries and features:
- libsigrok 0.5.2/5:1:1 (rt: 0.5.2/5:1:1).
 - Libs:
  - glib 2.67.5 (rt: 2.72.4/7204:4)
  - libzip 1.7.3
  - libserialport 0.1.1/1:0:1 (rt: 0.1.1/1:0:1)
  - libusb-1.0 1.0.25.11696 API 0x01000108
  - hidapi 0.10.1
  - bluez 5.56
  - libftdi 1.5
  - Host: x86_64-pc-linux-gnu, little-endian.
  - SCPI backends: TCP, serial, USBTMC.
- libsigrokdecode 0.5.3/6:1:2 (rt: 0.5.3/6:1:2).
 - Libs:
  - glib 2.71.1 (rt: 2.72.4/7204:4)
  - Python 3.10.2 / 0x30a02f0 (API 1013, ABI 3)
  - Host: x86_64-pc-linux-gnu, little-endian.
#+end_example

*** ~rdtech-dps~: DPS5020 driver in ~sigrok-cli~

Documentation on page https://sigrok.org/wiki/RDTech_DPS_series gives
the name of the driver, ~rdtech-dps~, for acccessing DPS5020 power
supply. The driver is bundled with ~sigrok-cli~, as demonstraded with
the command:

#+BEGIN_SRC bash :eval no-export :results output :exports both
sigrok-cli -L | grep rdtech-dps
#+END_SRC

#+RESULTS:
:   rdtech-dps           RDTech DPS/DPH series power supply

*** ~get~, ~set~ and ~config~: access device options
    
 This chapter demonstrates:
 - reading ~enabled~ status of DPS5020 (initially ~false~)
 - setting ~voltage_target~ to 3.3V
 - reading ~voltage_target~ to validate that is was set correctly
 - reading output ~voltage~ (expect 0V, because device is not enabled)
 - turning the output on by setting the ~enabled~ status to ~true~
 - reading output ~voltage~ (should match ~voltage_target~ once the device is on)
   enabled)
 - finally setting ~enabled~ status off

 The ~enabled~ status of DPS5020 on USB device ~/dev/ttyUSB0~ is read
 with the command
 #+name: get-enabled
 #+BEGIN_SRC bash :eval no-export :results output :exports both 
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --get enabled
 #+END_SRC

 #+RESULTS: get-enabled
 : false

 To set voltage target to ~3.3V~, pass ~--config~ and ~--set~ options,
 as shown below
 #+BEGIN_SRC bash :eval no-export :results output :exports both
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --config voltage_target=3.3V --set
 #+END_SRC

 #+RESULTS:

 Current voltage target is read with the command
 #+BEGIN_SRC bash :eval no-export :results output :exports both
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --get voltage_target
 #+END_SRC

 #+RESULTS:
 : 3.29

 If the device the output is not enabled, the voltage shows ~0.0~
 #+BEGIN_SRC bash :eval no-export :results output :exports both
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --get voltage
 #+END_SRC

 #+RESULTS:
 : 0.0

 After turning the device on,  
 #+BEGIN_SRC bash :eval no-export :results output :exports both 
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --config enabled=on --set
 #+END_SRC

 #+RESULTS:

 the enable status is ~true~
 #+BEGIN_SRC bash :eval no-export :results output :exports both 
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --get enabled
 #+END_SRC


 #+RESULTS:
 : true

 and the output voltage corresponds the target_voltage set above
 #+BEGIN_SRC bash :eval no-export :results output
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --get voltage
 #+END_SRC

 #+RESULTS:
 : 3.2799999999999998

 Finally, the device is turned off
 #+BEGIN_SRC bash :eval no-export :results output :exports both 
 sigrok-cli  --driver=rdtech-dps:conn=/dev/ttyUSB0 --config enabled=false --set
 #+END_SRC

 #+RESULTS:

*** ~dps5020.sh~: example use  

Example of using the script ~dps5020.sh~ to stepwise ramp voltage from 0 to 1V
(5 secs) to 2.5V (5 secs). After the ramp the device is turned off.

#+BEGIN_SRC bash :eval no-export :results output :exports both
dps5020.sh off voltage 0 on voltage 1 sleep 5 voltage 2.5 sleep 5  off 
#+END_SRC

#+RESULTS:
#+begin_example
+20230221-12:21:13 - off
+20230221-12:21:14 - set target voltage 0
+20230221-12:21:16 - on
+20230221-12:21:18 - set target voltage 1
+20230221-12:21:20 - enter sleep
+20230221-12:21:25 - exit sleep
+20230221-12:21:25 - set target voltage 2.5
+20230221-12:21:27 - enter sleep
+20230221-12:21:32 - exit sleep
+20230221-12:21:32 - off
#+end_example


